# DS 1 (UCSB, Fall 2020): Lecture 05 - Tables

In [1]:
from datascience import *
import numpy as np

**Flower petals and the Fibonacci Sequence**

"In the nature, these numbers occur in the number of flower petals: 3 – lily, iris, 5 – columbine, Delphinium, gilliflower, 8 – buttercup, Delphinium, 13 – garden mum, 21 – Astra, 34, 55, 89 – daisy. However, they also occur in the alignment of leaves, shoots and twigs, in the number of clockwise and counter-clockwise spirals on a pine cone and in the flower of sunflower, as well as in the number of spirals forming a hexagonal pineapple bark." (Source: [Flower petals and the Fibonacci Sequence?](https://vedanadosah.cvtisr.sk/en/flower-petals-and-the-fibonacci-sequence#:~:text=Each%20member%20of%20the%20sequence,%2C%2055%2C%2089%20–%20daisy.))

In [5]:
# Create an empty table
flowers = Table()

In [ ]:
flowers

In [ ]:
type(flowers)

In [ ]:
print("Num of rows", flowers.num_rows)
print("Num of columns", flowers.num_columns)

In [ ]:
# 3 – lily, iris, 
# 5 – columbine, Delphinium, gilliflower, 
# 8 – buttercup, Delphinium, 
# 13 – garden mum, 
# 21 – Astra, 
# 34, 55, 89 – daisy

In [2]:
# Add a column to the table

# Syntax: 
# Table().with_columns(‘Column name’, array_of_values)

Table().with_columns("Number of petals", make_array(3, 3, 5, 8))

Number of petals
3
3
5
8

In [6]:
flowers = flowers.with_columns("Number of petals", make_array(3, 3, 5, 8))

In [7]:
flowers

Number of petals
3
3
5
8

In [8]:
flowers = flowers.with_columns("Flower", make_array("lily", "iris", "columbine", "buttercup"))

In [9]:
flowers

Number of petals | Flower
3                | lily
3                | iris
5                | columbine
8                | buttercup

In [10]:
Table().with_columns("Number of petals", make_array(3, 3, 5, 8), 
                     "Flower", make_array("lily", "iris", "columbine", "buttercup"))

Number of petals | Flower
3                | lily
3                | iris
5                | columbine
8                | buttercup

In [11]:
flowers

Number of petals | Flower
3                | lily
3                | iris
5                | columbine
8                | buttercup

In [16]:
flowers.take([0, 2, 3])

Number of petals | Flower
3                | lily
5                | columbine
8                | buttercup

In [12]:
print(flowers)

Number of petals | Flower
3                | lily
3                | iris
5                | columbine
8                | buttercup

In [18]:
imdb = Table().read_table("data/imdb_2019.csv")
imdb.show(5)

In [27]:
# Get the first 100 movies
# indicies 0 - 99
#np.arange(0, 100, 1)
rows = np.arange(0, 100, 2)
rows

array([ 0,  2,  4,  6,  8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32,
       34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66,
       68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98])

In [28]:
first_100 = imdb.take(rows)
first_100

Votes  | Rating | Title             | Year | Decade
904453 | 8.3    | Braveheart        | 1995 | 1990
201660 | 8.2    | A Separation      | 2011 | 2010
143426 | 8.1    | Dial M for Murder | 1954 | 1950
248599 | 8.3    | The Hunt          | 2012 | 2010
692832 | 8.5    | The Intouchables  | 2011 | 2010
369764 | 8.3    | Citizen Kane      | 1941 | 1940
301787 | 8.4    | Princess Mononoke | 1997 | 1990
129638 | 8.3    | Dangal            | 2016 | 2010
49290  | 8.1    | The Wages of Fear | 1953 | 1950
289095 | 8.1    | The Deer Hunter   | 1978 | 1970
... (40 rows omitted)

In [ ]:
rating = imdb.column("Rating")
rating

In [ ]:
max(rating)

In [ ]:
min(rating)

In [ ]:
imdb.sort("Rating", descending=True)

In [ ]:
imdb.sort("Year")

In [ ]:
imdb.sort("Year", descending=True)

In [ ]:
imdb.where("Year", 2019)

In [ ]:
#imdb.sort("Votes", descending=False)
imdb.sort("Votes")

In [ ]:
imdb.sort("Votes", descending=False)
#imdb.sort("Votes", ascending=True)